Infineon/mtb-example-psoc-edge-rock-paper-scissors-game/proj_cm55/lcd_utlis/source/image_conv.c
/******************************************************************************
* File Name:   image_conv.c
*
* Description: This file implements the image format conversions.
*
* Related Document: See README.md
*
*
********************************************************************************
* (c) 2025-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/
#include "cy_syslib.h"
#include "ifx_image_utils.h"

/*******************************************************************************
* Macros
*******************************************************************************/
/* usual shift-conversion function sets the low 2 or 3 bits in each channel to 0.
 so, the brightest 16-bit color (0xFFFF) becomes the 24-bit color of R=0xF8, G=0xFC, B=0xF8,
 which is not the brightest 24-bit color (0xFFFFFF).
 fill these low 2 or 3 bits by burning more cycles.
 red, blue: ([0, 0xF8] * 66) >> 6 => ([0, 248] * 66) >> 6 => [0, 16368] >> 6 => ([0, 255.75]) => [0, 255]
 green:([0, 0xFC] * 65) >> 6 => ([0, 252] * 65) >> 6 => [0, 16380] >> 6 => ([0, 255.94]) => [0, 255]*/

#define GET_MSB(a, bits, ofs)  ((((a) >> (8 - (bits))) & ((1 << (bits)) - 1)) << (ofs))

/*******************************************************************************
* Function prototypes
*******************************************************************************/
int8_t * RGB565_to_RGB888_i8( uint32_t pixel, int8_t *rgb888_8p );

/*******************************************************************************
 * Function Name: ifx_pixel_RGB888_to_RGB565
 ********************************************************************************
* Summary: Converts a color pixel value from RGB888 to RGB565.
*
* Parameters:
*  r   : 0-255 red color value
*  g   : 0-255 green color value
*  b   : 0-255 blue color value
*
* Return:
*  16-bit color in RGB565
*
*******************************************************************************/
inline
uint16_t ifx_pixel_RGB888_to_RGB565(uint32_t r, uint32_t g, uint32_t b)
{
    b = GET_MSB(b, 5,  0);
    g = GET_MSB(g, 6,  5);
    r = GET_MSB(r, 5, 11);

    return (uint16_t)(r | g | b);
}

/*******************************************************************************
* Function Name: ifx_pixel_RGB565_to_RGB888_value
********************************************************************************
* Summary:
*  Converts 16-bit RGB565 to 24-bit RGB value.
*
* Parameters:
*  uint32_t rgb565: RGB565 value
*
* Return:
*  uint32_t: 24-bit RGB value
*
*******************************************************************************/
inline
uint32_t ifx_pixel_RGB565_to_RGB888_value( uint32_t rgb565 )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order)*/
    uint32_t    blue  = (rgb565 << 3) & 0xF8u;      /* [0, 248], Extract lower 5 bits for blue */
    uint32_t    green = (rgb565 >> 3) & 0xFCu;      /* [0, 252], Extract middle 6 bits for green, right shift 5 for 8-bit representation */
    uint32_t    red   = (rgb565 >> 8) & 0xF8u;      /* [0, 248], Extract upper 5 bits for red, right shift 11 for 8-bit representation */

#ifdef BGR888_FULL_8_BIT
    red   = (red   * 66) >> 6;
    green = (green * 65) >> 6;
    blue  = (blue  * 66) >> 6;
#endif  /* BGR888_FULL_8_BIT */

    return (uint32_t)((blue << 16) | (green << 8) | red);   /* image array sequence */
}

/*******************************************************************************
* Function Name: ifx_pixel_RGB565_to_RGB888
********************************************************************************
* Summary:
*  Converts RGB565 image to signed RGB888.
*
* Parameters:
*  uint32_t rgb565: RGB565 value
*  uint8_t *rgb888: destination buffer for RGB888 value
*
* Return:
*  uint8_t *: destination buffer address
*
*******************************************************************************/
inline
uint8_t * ifx_pixel_RGB565_to_RGB888( uint32_t rgb565, uint8_t *rgb888 )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order)*/
    uint32_t    blue  = (rgb565 << 3) & 0xF8u;      /* [0, 248], Extract lower 5 bits for blue */
    uint32_t    green = (rgb565 >> 3) & 0xFCu;      /* [0, 252], Extract middle 6 bits for green, right shift 5 for 8-bit representation */
    uint32_t    red   = (rgb565 >> 8) & 0xF8u;      /* [0, 248], Extract upper 5 bits for red, right shift 11 for 8-bit representation */

#ifdef BGR888_FULL_8_BIT
    red   = (red   * 66) >> 6;
    green = (green * 65) >> 6;
    blue  = (blue  * 66) >> 6;
#endif  /* BGR888_FULL_8_BIT */

    *rgb888++ = (uint8_t)red;
    *rgb888++ = (uint8_t)green;
    *rgb888++ = (uint8_t)blue;

    return rgb888;
}

