Infineon/mtb-example-psoc-edge-rock-paper-scissors-game/proj_cm55/lcd_utlis/source/image_conv.c
/*******************************************************************************
* Function Name: ifx_pixel_2_RGB565_to_RGB888
********************************************************************************
* Summary:
*  Converts RGB565 image to signed RGB888.
*
* Parameters:
*  uint32_t rgb565: RGB565 value
*  uint8_t *rgb888: destination buffer for RGB888 value
*
*
* Return:
*  uint32_t: RGBX value
*
*******************************************************************************/
inline
uint8_t * ifx_pixel_2_RGB565_to_RGB888( uint32_t rgb565, uint8_t *rgb888 )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order) */
    /* low 16-bit: the first pixel, high 16-bit: the second pixel */
    uint32_t    blue  = (rgb565 << 3) & 0x0F800F8u;     /* xxB1 | xxB0 */
    uint32_t    green = (rgb565 >> 3) & 0x0FC00FCu;     /* xxG1 | xxG0 */
    uint32_t    red   = (rgb565 >> 8) & 0x0F800F8u;     /* xxR1 | xxR0 */

#ifdef BGR888_FULL_8_BIT
    red   = (red   * 66) >> 6;
    green = (green * 65) >> 6;
    blue  = (blue  * 66) >> 6;
#endif  /* BGR888_FULL_8_BIT */

    uint16_t    *rgb888_16p = (uint16_t *)rgb888;
    uint32_t    rg = (green << 8) | red;        /* G1R1 | G0R0* */
    uint32_t    br = (red   >> 8) | blue;       /* xxB1 | R1B0* */
    uint32_t    gb = (blue  << 8) | green;      /* B1G1*| B0G0 */

    *rgb888_16p++ = (uint16_t)rg;
    *rgb888_16p++ = (uint16_t)br;
    *rgb888_16p++ = (uint16_t)(gb >> 16);

    return (uint8_t *)rgb888_16p;
}

/*******************************************************************************
* Function Name: ifx_pixel_RGB565_to_RGB888_u2i
********************************************************************************
* Summary:
*  Converts a 16-bit RGB565 pixel to signed 24-bit RGB888 with zero point adjustment.
*
* Parameters:
*  uint32_t rgb565: 16-bit RGB565 pixel value
*  int8_t *rgb888: Pointer to the destination signed RGB888 buffer
*  int32_t zero_point: Zero point adjustment for the conversion
*
* Return:
*  int8_t *: Pointer to the next position in the destination buffer
*
*******************************************************************************/
inline
int8_t * ifx_pixel_RGB565_to_RGB888_u2i( uint32_t rgb565, int8_t *rgb888, int32_t zero_point )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order) */
    int blue   = (rgb565 << 3) & 0x0F8;         /* Extract lower 5 bits for blue */
    int green  = (rgb565 >> 3) & 0x0FC;         /* Extract middle 6 bits for green, right shift 5 for 8-bit representation */
    int red    = (rgb565 >> 8) & 0x0F8;         /* Extract upper 5 bits for red, right shift 11 for 8-bit representation */

#ifdef BGR888_FULL_8_BIT
    red   = (red   * 66) >> 6;
    green = (green * 65) >> 6;
    blue  = (blue  * 66) >> 6;
#endif  /* BGR888_FULL_8_BIT */

    *rgb888++ = red   + zero_point;
    *rgb888++ = green + zero_point;
    *rgb888++ = blue  + zero_point;

    return rgb888;
}

/*******************************************************************************
* Function Name: ifx_pixel_2_RGB565_to_RGB888_u2i
********************************************************************************
* Summary:
*  Converts two 16-bit RGB565 pixels (packed in a 32-bit value) to signed 24-bit
*  RGB888 with zero point adjustment.
*
* Parameters:
*  uint32_t rgb565: 32-bit value containing two RGB565 pixels (low 16-bit: first pixel, high 16-bit: second pixel)
*  int8_t *rgb888: Pointer to the destination signed RGB888 buffer
*  int32_t zero_point: Zero point adjustment for the conversion
*
* Return:
*  int8_t *: Pointer to the next position in the destination buffer
*
*******************************************************************************/
int8_t * ifx_pixel_2_RGB565_to_RGB888_u2i( uint32_t rgb565, int8_t *rgb888, int32_t zero_point )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order) */
    /* low 16-bit: the first pixel, high 16-bit: the second pixel */
    int32_t blue   = (rgb565 << 3) & 0x0F800F8;     /* Extract lower 5 bits for blue */
    int32_t green  = (rgb565 >> 3) & 0x0FC00FC;     /* Extract middle 6 bits for green, right shift 5 for 8-bit representation */
    int32_t red    = (rgb565 >> 8) & 0x0F800F8;     /* Extract upper 5 bits for red, right shift 11 for 8-bit representation */

#ifdef BGR888_FULL_8_BIT
    red   = (red   * 66) >> 6;
    green = (green * 65) >> 6;
    blue  = (blue  * 66) >> 6;
#endif  /* BGR888_FULL_8_BIT */

#if defined (ARM_MATH_DSP)
    int32_t zero_point_packed;      /* Offset packed to 32 bit */

    /* Offset is packed to 32 bit in order to use SIMD32 for addition */
    zero_point_packed = __PKHBT(zero_point, zero_point, 16);
    /* Add offset and store result in destination buffer (2 samples at a time). */
    red   = __QADD16(red,   zero_point_packed);
    green = __QADD16(green, zero_point_packed);
    blue  = __QADD16(blue,  zero_point_packed);

    /* the first pixel */
    *rgb888++ = (int8_t)(red);
    *rgb888++ = (int8_t)(green);
    *rgb888++ = (int8_t)(blue);
    /* the second pixel */
    *rgb888++ = (int8_t)((red   >> 16));
    *rgb888++ = (int8_t)((green >> 16));
    *rgb888++ = (int8_t)((blue  >> 16));
#else
    /* the first pixel */
    *rgb888++ = (int8_t)((red  ) + zero_point);
    *rgb888++ = (int8_t)((green) + zero_point);
    *rgb888++ = (int8_t)((blue ) + zero_point);
    /* the second pixel */
    *rgb888++ = (int8_t)(((red   >> 16)) + zero_point);
    *rgb888++ = (int8_t)(((green >> 16)) + zero_point);
    *rgb888++ = (int8_t)(((blue  >> 16)) + zero_point);
#endif

    return rgb888;
}

#ifdef ARM_MATH_MVEI

#define get_write_RGB(src)    \
            *rgb888_16p++ = (uint16_t)vgetq_lane_u16( RG, src );      \
            *rgb888_16p++ = (uint16_t)vgetq_lane_u16( BR, src + 1 );  \
            *rgb888_16p++ = (uint16_t)vgetq_lane_u16( GB, src + 1 )

/* ifx_image_conv_RGB565_to_RGB888_16_narrow */
CY_SECTION_ITCM_BEGIN
void ifx_image_conv_RGB565_to_RGB888( uint8_t *src_bgr565, int32_t width, int32_t height,
                                      uint8_t *dst_rgb888, int32_t dst_width, int32_t dst_height )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width,  dst_width );
    int offset_width = ( width - min_width ) >> 1;
    int blk_cnt      = min_width >> 3;              /* 8-pixel block: 16-byte: 128-bit */
    int blk_remainder= min_width & 0x07;
    uint16_t   *src_bgr565_16p = (uint16_t *) &src_bgr565[offset_width << 1];   /* 2 bytes per pixel */
    uint16x8_t  vmask_red_blue = vdupq_n_u16( 0xF800u );
    uint16x8_t  vmask_green    = vdupq_n_u16( 0xFC00u );

    for ( int i = 0; i < min_height; i++ ) {
        uint16_t    *rgb888_16p = (uint16_t *)&dst_rgb888[i * dst_width * 3];   /* 3 bytes per pixel */
        uint16_t    *bgr565_16p = &src_bgr565_16p[i * width];

