Infineon/mtb-example-psoc-edge-rock-paper-scissors-game/proj_cm55/lcd_utlis/source/image_conv.c
        for ( int jj = blk_cnt; jj > 0; jj--, bgr565_16p += 8 ) {
            /* process 8 16-bit RGB565 colors (pixels) simultaneously in the vector unit */
            uint16x8_t  bgr565 = vldrhq_u16( bgr565_16p );  /* load 8 16-bit RGB565 into a vector reg. */
            uint16x8_t  red    = bgr565;                    /* move R to the high-bytes */
            uint16x8_t  green  = vshlq_n_u16( bgr565,  5 ); /* move G to the high-bytes */
            uint16x8_t  blue   = vshlq_n_u16( bgr565, 11 ); /* move B to the high-bytes */

            /* clear not-relavant bits in each color vector */
            red   = vandq_u16( red,   vmask_red_blue );     /* R3-- | R2-- | R1-- | R0-- */
            green = vandq_u16( green, vmask_green );        /* G3-- | G2-- | G1-- | G0-- */
            blue  = vandq_u16( blue,  vmask_red_blue );     /* B3-- | B2-- | B1-- | B0-- */

            /* shift colors to the high-bytes to combine with the low-byte in other colors */
            uint16x8_t  Bs = (uint16x8_t)vshlq_n_u32( (uint32x4_t)blue, 8 );            /* --B2 | --xx | --B0 | --xx */

            /* combine the high-bytes and the low-bytes into 2-byte words */
            uint16x8_t  RG = (uint16x8_t)vshrnbq_n_u16( (uint8x16_t)green, red, 8 );    /* G3R3 |*G2R2*| G1R1 |*G0R0* */
            uint16x8_t  BR = vorrq_u16( Bs, red );                                      /**R3B2*| R1xx |*R1B0*| R0xx */
            uint16x8_t  GB = (uint16x8_t)vshrnbq_n_u16( (uint8x16_t)blue, green, 8 );   /**B3G3*| B2G2 |*B1G1*| B0G0 */

            get_write_RGB(0);
            get_write_RGB(2);
            get_write_RGB(4);
            get_write_RGB(6);
        }
        if ( blk_remainder > 0 ) {
            uint8_t *rgb888 = (uint8_t *)rgb888_16p;

            for ( int jj = blk_remainder; jj > 0; jj-- ) {
                uint16_t    pixel = *bgr565_16p++;

                rgb888 = ifx_pixel_RGB565_to_RGB888( pixel, rgb888 );
            }
        }
    }
}
CY_SECTION_ITCM_END

#define get_write_RGB_u2i(idx)    \
            *rgb888_8p++ = (int8_t)vgetq_lane_s16( red,   idx );  \
            *rgb888_8p++ = (int8_t)vgetq_lane_s16( green, idx );  \
            *rgb888_8p++ = (int8_t)vgetq_lane_s16( blue,  idx )

void ifx_image_conv_RGB565_to_RGB888_u2i( uint8_t *src_bgr565, int32_t width, int32_t height,
                                          int8_t *dst_rgb888_i8, int32_t dst_width, int32_t dst_height,
                                          int32_t zero_point )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width,  dst_width );
    int offset_width = ( width - min_width ) >> 1;
    int blk_cnt      = width >> 3;
    int blk_remainder= width & 0x07;
    uint16_t   *src_bgr565_16p = (uint16_t *) &src_bgr565[offset_width << 1];   /* 2 bytes per pixel */
    int16x8_t   vmask_red_blue = vdupq_n_s16( 0x0F8 );
    int16x8_t   vmask_green    = vdupq_n_s16( 0x0FC );
    int16x8_t   vzero_point    = vdupq_n_s16( zero_point );

    for ( int i = 0; i < min_height; i++ ) {
        int8_t      *rgb888_8p  = &dst_rgb888_i8[i * dst_width * 3];   /* 3 bytes per pixel */
        uint16_t    *bgr565_16p = &src_bgr565_16p[i * width];

        for ( int jj = blk_cnt; jj > 0; jj--, bgr565_16p += 8 ) {
            /* process 8 16-bit RGB565 colors (pixels) simultaneously in the vector unit */
            uint16x8_t bgr565 = vldrhq_u16( bgr565_16p );                           /* load 8 16-bit RGB565 into a vector reg. */
            int16x8_t  red    = vreinterpretq_s16_u16(vshrq_n_u16( bgr565, 8 ));    /* move R to the low-bytes */
            int16x8_t  green  = vreinterpretq_s16_u16(vshrq_n_u16( bgr565, 3 ));    /* move G to the low-bytes */
            int16x8_t  blue   = vreinterpretq_s16_u16(vshlq_n_u16( bgr565, 3 ));    /* adjust B to the low-bytes */

            /* clear not-relavant bits in each color vector */
            red   = vandq_s16( red,   vmask_red_blue );     /* --R3 | --R2 | --R1 | --R0 */
            green = vandq_s16( green, vmask_green );        /* --G3 | --G2 | --G1 | --G0 */
            blue  = vandq_s16( blue,  vmask_red_blue );     /* --B3 | --B2 | --B1 | --B0 */

            red   = vaddq_s16( vzero_point, red );
            green = vaddq_s16( vzero_point, green );
            blue  = vaddq_s16( vzero_point, blue );

            get_write_RGB_u2i(0);
            get_write_RGB_u2i(1);
            get_write_RGB_u2i(2);
            get_write_RGB_u2i(3);
            get_write_RGB_u2i(4);
            get_write_RGB_u2i(5);
            get_write_RGB_u2i(6);
            get_write_RGB_u2i(7);
        }
        if ( blk_remainder > 0 ) {
            for ( int jj = blk_remainder; jj > 0; jj-- ) {
                uint16_t    pixel = *bgr565_16p++;

                rgb888_8p = ifx_pixel_RGB565_to_RGB888_u2i( pixel, rgb888_8p, zero_point );
            }
        }
    }
}

#else

CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: ifx_image_conv_RGB565_to_RGB888
********************************************************************************
* Summary:
*  Converts an RGB565 image to an RGB888 image using 32-bit memory access for two pixels.
*
* Parameters:
*  uint8_t *src_bgr565: Pointer to the source RGB565 image buffer
*  int32_t width: Width of the source image
*  int32_t height: Height of the source image
*  uint8_t *dst_rgb888: Pointer to the destination RGB888 image buffer
*  int32_t dst_width: Width of the destination image
*  int32_t dst_height: Height of the destination image
*
* Return:
*  None
*
*******************************************************************************/
void ifx_image_conv_RGB565_to_RGB888( uint8_t *src_bgr565, int32_t width, int32_t height,
                                      uint8_t *dst_rgb888, int32_t dst_width, int32_t dst_height )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width,  dst_width );
    int offset_width = ( width - min_width ) >> 1;      /* positive offset, if the source is wider */
    uint16_t    *src_bgr565_16p = (uint16_t *) &src_bgr565[offset_width << 1];   /* 2 bytes per pixel */

    for ( int i = 0; i < min_height; i++ ) {
        uint8_t     *rgb888     = &dst_rgb888[i * dst_width * 3];   /* 3 bytes per pixel */
        uint32_t    *bgr565_32p = (uint32_t *)&src_bgr565_16p[i * width];

        for ( int j = (min_width >> 1); j > 0; j-- ) {
            /* two-pixel RGB565 memory-access: one 32-bit read of 4-byte */
            uint32_t    pixel = *bgr565_32p++;

#if 1
            rgb888 = ifx_pixel_2_RGB565_to_RGB888( pixel, rgb888 );
#else
            /* process low (15:0) first pixel */
            rgb888 = ifx_pixel_RGB565_to_RGB888( pixel, rgb888 );

            /* process high (31:16) second pixel */
            rgb888 = ifx_pixel_RGB565_to_RGB888( pixel >> 16, rgb888 );
#endif  /* 0/1 */
        }
    }
}
CY_SECTION_ITCM_END

