Infineon/mtb-example-psoc-edge-rock-paper-scissors-game/proj_cm55/lcd_utlis/source/image_conv.c
/*******************************************************************************
* Function Name: ifx_pixel_RGB888_to_RGBX32
********************************************************************************
* Summary:
*  Converts 24-bit RGB to 32-bit RGBX.
*
* Parameters:
*  uint32_t r: Red component
*  uint32_t g: Green component
*  uint32_t b: Blue component
*
* Return:
*  uint32_t: 32-bit RGBX value
*
*******************************************************************************/
inline
uint32_t ifx_pixel_RGB888_to_RGBX32( uint32_t r, uint32_t g, uint32_t b )
{
    return ((r << 16) | (g << 8) | b);
}

/*******************************************************************************
* Function Name: ifx_pixel_xRGB32_to_RGB565
********************************************************************************
* Summary:
*  Converts 32-bit xRGB to 16-bit RGB565.
*
* Parameters:
*  uint32_t xRGB: 32-bit xRGB value
*
* Return:
*  uint16_t: 16-bit RGB565 value
*
*******************************************************************************/
inline
uint16_t ifx_pixel_xRGB32_to_RGB565( uint32_t xRGB )
{
    uint16_t    r = (xRGB >> 8) & 0xF800u;
    uint16_t    g = (xRGB >> 5) & 0x07E0u;
    uint16_t    b = (xRGB >> 3) & 0x001Fu;

    return (uint16_t)(r | g | b);
}

/*******************************************************************************
* Function Name: ifx_image_conv_RGBX32_to_RGB24
********************************************************************************
* Summary:
*  Converts an RGBX32 image to an RGB24 image.
*
* Parameters:
*  uint8_t *src_rgbx32: Pointer to the source RGBX32 image buffer
*  int32_t width: Width of the source image
*  int32_t height: Height of the source image
*  uint8_t *dst_rgb888: Pointer to the destination RGB888 image buffer
*  int32_t dst_width: Width of the destination image
*  int32_t dst_height: Height of the destination image
*
* Return:
*  None
*
*******************************************************************************/
void ifx_image_conv_RGBX32_to_RGB24( uint8_t *src_rgbx32, int32_t width, int32_t height,
                                     uint8_t *dst_rgb888, int32_t dst_width, int32_t dst_height )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width, dst_width );
    int offset_width = ( width - min_width ) >> 1;
    uint32_t    *src_32p = (uint32_t *)&src_rgbx32[offset_width << 1];

    for ( int i = 0; i < min_height; i++ ) {
        uint8_t     *dp = &dst_rgb888[i * dst_width * 3];
        uint32_t    *sp = &src_32p[i * width];

        for ( int j = 0; j < min_width; j++ ) {
            uint32_t    pixel = *sp++;

            *dp++ = (uint8_t)(pixel >> 16);
            *dp++ = (uint8_t)(pixel >>  8);
            *dp++ = (uint8_t)(pixel);
        }
    }
}

/*******************************************************************************
* Function Name: ifx_image_conv_RGBX32_to_RGB24_u2i
********************************************************************************
* Summary:
*  Converts an RGBX32 image to a signed RGB24 image with zero point adjustment.
*
* Parameters:
*  uint8_t *src_rgbx32: Pointer to the source RGBX32 image buffer
*  int32_t width: Width of the source image
*  int32_t height: Height of the source image
*  int8_t *dst_rgb888: Pointer to the destination signed RGB888 image buffer
*  int32_t dst_width: Width of the destination image
*  int32_t dst_height: Height of the destination image
*  int32_t zero_point: Zero point adjustment for the conversion
*
* Return:
*  None
*
*******************************************************************************/
void ifx_image_conv_RGBX32_to_RGB24_u2i( uint8_t *src_rgbx32, int32_t width, int32_t height,
                                         int8_t  *dst_rgb888, int32_t dst_width, int32_t dst_height,
                                         int32_t zero_point )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width, dst_width );
    int offset_width = ( width - min_width ) >> 1;
    uint32_t    *src_32p = (uint32_t *)&src_rgbx32[offset_width << 1];

    for ( int i = 0; i < min_height; i++ ) {
        int8_t      *dp = &dst_rgb888[i * dst_width * 3];
        uint32_t    *sp = &src_32p[i * width];

        for ( int j = 0; j < min_width; j++ ) {
            uint32_t    pixel = *sp++;

            *dp++ = (int8_t)((pixel >> 16) + zero_point);
            *dp++ = (int8_t)((pixel >>  8) + zero_point);
            *dp++ = (int8_t)((pixel      ) + zero_point);
        }
    }
}
/*******************************************************************************
* Function Name: IMAGE_DrawPixel
********************************************************************************
* Summary:
*   Draws pixel with RGB color to defined point.
*
* Parameters:
*  uint16_t *pDst        : pointer to the display buffer
*  uint16_t x            : drawing position on X axis
*  uint16_t y            : drawing position on Y axis
*  uint16_t r            : 0-255 red color value
*  uint16_t g            : 0-255 green color value
*  uint16_t b            : 0-255 blue color value
*  uint16_t lcd_w        : LCD display width
*  uint16_t lcd_h        : LCD display height
*
* Return:
*  None
*
*******************************************************************************/
void IMAGE_DrawPixel( uint16_t *pDst, uint16_t x, uint16_t y, uint16_t r, uint16_t g, uint16_t b, uint16_t lcd_w, uint16_t lcd_h )
{
    if ( x < lcd_w  &&  y < lcd_h ) {
        uint16_t rgb565 = ifx_pixel_RGB888_to_RGB565(r, g, b);

        pDst[(y * lcd_w) + x] = rgb565;
    }
}

